Project/Toir.Adaptation/src/InformationRegisters/торо_РасположениеОРВСтруктуреИерархии/торо_РасположениеОРВСтруктуреИерархии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="774db338-91f2-4ead-8895-fd51f145458a">
  <name>торо_РасположениеОРВСтруктуреИерархии</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="d8481881-51b9-4962-8b6c-bfa78e30e457">
    <name>РодительИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="2c99b177-de41-496b-bfc8-0cd1b039671a">
    <name>Удален</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="280e0fd3-b182-49f3-abd2-2c4247cfe274">
    <name>ОбъектИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6bc5297f-c3fd-4ba2-ad6f-c69875395c47">
    <name>СтруктураИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ИерархическиеСтруктурыОР/торо_ИерархическиеСтруктурыОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ИерархическиеСтруктурыОР</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ecf4614a-f3c8-44c8-9355-8a406a840ca5">
    <name>РодительИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="c4d866bf-46bc-412c-b7cf-a88074622812">
    <name>ОбъектИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7f327261-9505-4dcb-bf45-cd6eb8ce0242">
    <name>СтруктураИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/CommonModules/торо_ГарантийноеОбслуживание/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуГарантийФМ(ОбъектРемонта, ДатаОкончания = Неопределено) Экспорт
	
	Иерархия = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	Если Иерархия.ИзменяетсяДокументами Тогда 
		ТекстЗапросаПодчиненных = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.ОбъектИерархии КАК ОР
		|ПОМЕСТИТЬ ПодчиненныеОР
		|ИЗ
		|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
		|			,
		|			СтруктураИерархии В
		|					(ВЫБРАТЬ
		|						торо_ИерархияДляВводаНовыхОР.Значение КАК Значение
		|					ИЗ
		|						Константа.торо_ИерархияДляВводаНовыхОР КАК торо_ИерархияДляВводаНовыхОР)
		|				И РодительИерархии = &ОбъектРемонта) КАК торо_РасположениеОРВСтруктуреИерархииСрезПоследних"+"
		|;
		| ";
	Иначе
		ТекстЗапросаПодчиненных = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ИерархическиеСтруктурыОР.ОбъектИерархии КАК ОР
		|ПОМЕСТИТЬ ПодчиненныеОР
		|ИЗ
		|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
		|ГДЕ
		|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии В
		|			(ВЫБРАТЬ
		|				торо_ИерархияДляВводаНовыхОР.Значение КАК Значение
		|			ИЗ
		|				Константа.торо_ИерархияДляВводаНовыхОР КАК торо_ИерархияДляВводаНовыхОР)
		|	И торо_ИерархическиеСтруктурыОР.РодительИерархии = &ОбъектРемонта"+"
		|;
		| ";
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПодчиненных + "ВЫБРАТЬ
	                                         |	торо_СрокиГарантииОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
	                                         |	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии КАК УсловияГарантии,
	                                         |	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ДатаНачалаГарантии КАК ДатаНачала,
	                                         |	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ДатаОкончанияГарантии КАК ДатаОкончания,
	                                         |	торо_СрокиГарантииОбъектовРемонта.ГарантирующаяОрганизация КАК ГарантирующаяОрганизация,
	                                         |	торо_СрокиГарантииОбъектовРемонта.Договор КАК Договор,
	                                         |	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ПроверятьПериодГарантии КАК ПроверятьПериодГарантии,
	                                         |	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ПроверятьНаработку КАК ПроверятьНаработку,
	                                         |	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ПоказательНаработки КАК ПоказательНаработки,
	                                         |	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ЗначениеНаработки КАК ЗначениеНаработки
	                                         |ИЗ
	                                         |	РегистрСведений.торо_СрокиГарантииОбъектовРемонта КАК торо_СрокиГарантииОбъектовРемонта
	                                         |ГДЕ
	                                         |	торо_СрокиГарантииОбъектовРемонта.ОбъектРемонта В
	                                         |			(ВЫБРАТЬ
	                                         |				ТЧ.ОР
	                                         |			ИЗ
	                                         |				ПодчиненныеОР КАК ТЧ)";
	
	Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);
	
	ТаблицаГарантий = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаГарантий;
	
КонецФункции

#КонецОбласти
